src_doc/InformationRegisters/ПравилаУчетаВидовЭДДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПравилаУчетаВидовЭДДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВопросДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Папка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПапкиДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РольФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТематикаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТематикиДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТребуетсяИзвещениеОПолучении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТребуетсяОтветнаяПодпись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонСодержания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УдалитьВидЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовЭДО</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьТипЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыПроизвольныхДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/НастройкиОтправкиДокументовПоЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОтправкиДокументовПоЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДокументаЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяИзвещениеОПолучении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяОтветнаяПодпись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТипЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыПроизвольныхДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/ПриглашенияКОбменуЭлектроннымиДокументами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПриглашенияКОбменуЭлектроннымиДокументами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОператора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Данные организации, владеющей идентификатором контрагента, указанном в приглашении. Являются достоверными только при статусах приглашения "Принято", "ТребуетсяСогласие". Используется для: 1) заполнения в служебных квитанциях (извещении о получении, уведомлении об уточнении, предложении об аннулировании), так как в них указываются данные транспортных участников обмена, а не логических (т.е. в документе может быть один контрагент, а получен он может быть от другого).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Comment>Данные организации, владеющей идентификатором контрагента, указанном в приглашении. Являются достоверными только при статусах приглашения "Принято", "ТребуетсяСогласие". Используется для: 1) заполнения в служебных квитанциях (извещении о получении, уведомлении об уточнении, предложении об аннулировании), так как в них указываются данные транспортных участников обмена, а не логических (т.е. в документе может быть один контрагент, а получен он может быть от другого).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОператорЭДОКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПриглашений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПриглашений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Ссылка на контрагента информационной базы, соответствующего владельцу идентификатора контрагента, указанного в приглашении. Используется для: 1) заполнения его во входящем произвольном документе в случае, если данные контрагента не указаны в транспортной информации; 2) вывода и фильтрации в списке приглашений; 3) стартового создания настроек отправки/получения при переходе связи в состояние "Принято".</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Данные организации, владеющей идентификатором контрагента, указанном в приглашении. Являются достоверными только при статусах приглашения "Принято", "ТребуетсяСогласие". Используется для: 1) заполнения в служебных квитанциях (извещении о получении, уведомлении об уточнении, предложении об аннулировании), так как в них указываются данные транспортных участников обмена, а не логических (т.е. в документе может быть один контрагент, а получен он может быть от другого).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПриглашения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ознакомиться</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Comment>Для внутренних операций - "КлючПриглашения", для взаимодействия с сервисом - "ВнешнийКод", "ExternalContactId". При отправке широковещательного приглашения не заполняется.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/CommonModules/ОбменСКонтрагентамиДО/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ОбработчикиОбновлений

// Обработка обновления.
// Заполняет в регистре Правила учетов видов ЭД ДО новое измерение "Организация".
Процедура ОбновитьПравилаУчетаВидовЭД() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПравилаУчетаВидовЭДДО.УдалитьВидЭД КАК УдалитьВидЭД,
		|	ПравилаУчетаВидовЭДДО.Контрагент КАК Контрагент,
		|	ПравилаУчетаВидовЭДДО.УдалитьТипЭД КАК УдалитьТипЭД,
		|	ПравилаУчетаВидовЭДДО.ВидДокумента КАК ВидДокумента,
		|	ПравилаУчетаВидовЭДДО.ВопросДеятельности КАК ВопросДеятельности,
		|	ПравилаУчетаВидовЭДДО.Ответственный КАК Ответственный,
		|	ПравилаУчетаВидовЭДДО.Папка КАК Папка,
		|	ПравилаУчетаВидовЭДДО.УдалитьТребуетсяИзвещениеОПолучении КАК УдалитьТребуетсяИзвещениеОПолучении,
		|	ПравилаУчетаВидовЭДДО.УдалитьТребуетсяОтветнаяПодпись КАК УдалитьТребуетсяОтветнаяПодпись,
		|	ПравилаУчетаВидовЭДДО.Шаблон КАК Шаблон,
		|	ПравилаУчетаВидовЭДДО.ШаблонНаименования КАК ШаблонНаименования,
		|	ПравилаУчетаВидовЭДДО.ШаблонСодержания КАК ШаблонСодержания
		|ИЗ
		|	РегистрСведений.ПравилаУчетаВидовЭДДО КАК ПравилаУчетаВидовЭДДО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УдалитьПрофилиНастроекЭДО.Организация КАК Организация
		|ИЗ
		|	Справочник.УдалитьПрофилиНастроекЭДО КАК УдалитьПрофилиНастроекЭДО
		|ГДЕ
		|	НЕ УдалитьПрофилиНастроекЭДО.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	УдалитьПрофилиНастроекЭДО.Организация";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ПравилаЗаписанные = РезультатыЗапроса[РезультатыЗапроса.Количество() - 2].Выгрузить();
	ОрганизацииЭДО = РезультатыЗапроса[РезультатыЗапроса.Количество() - 1].Выгрузить().ВыгрузитьКолонку("Организация");
	
	НаборЗаписей = РегистрыСведений.ПравилаУчетаВидовЭДДО.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого Организация Из ОрганизацииЭДО Цикл
		Для Каждого ПравилоУчета Из ПравилаЗаписанные Цикл
			
			Запись = НаборЗаписей.Добавить();
			
			Запись.Организация = Организация;
			Запись.СоздаватьАвтоматически = Истина;
			
			ЗаполнитьЗначенияСвойств(Запись, ПравилоУчета);
			
		КонецЦикла;
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПравилаУчетаВидовЭДДО");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстИсключения =
			НСтр("ru = 'При обновлении правил учета видов ДО по причине:'")
			+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ПравилаУчетаВидовЭДДО, ,
			ТекстИсключения);
		
		ВызватьИсключение ТекстИсключения;
		
	КонецПопытки;
	
КонецПроцедуры

// Обработчик обновления.
// Заполняет правила отправки документов по ЭДО на основании данных регистра Правил учета видов ЭД ДО.
Процедура ЗаполнитьПравилаОтправкиДокументовЭДО() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УдалитьСоглашенияОбИспользованииЭД.Организация КАК Организация,
		|	УдалитьСоглашенияОбИспользованииЭД.Контрагент КАК Контрагент
		|ИЗ
		|	Справочник.УдалитьСоглашенияОбИспользованииЭД КАК УдалитьСоглашенияОбИспользованииЭД
		|ГДЕ
		|	НЕ УдалитьСоглашенияОбИспользованииЭД.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	УдалитьСоглашенияОбИспользованииЭД.Организация,
		|	УдалитьСоглашенияОбИспользованииЭД.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПравилаУчетаВидовЭДДО.Организация КАК Организация,
		|	ПравилаУчетаВидовЭДДО.Контрагент КАК Контрагент,
		|	ПравилаУчетаВидовЭДДО.ВидДокумента КАК ВидДокумента
		|ИЗ
		|	РегистрСведений.ПравилаУчетаВидовЭДДО КАК ПравилаУчетаВидовЭДДО
		|
		|СГРУППИРОВАТЬ ПО
		|	ПравилаУчетаВидовЭДДО.Организация,
		|	ПравилаУчетаВидовЭДДО.Контрагент,
		|	ПравилаУчетаВидовЭДДО.ВидДокумента";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаСторонОбмена = РезультатыЗапроса[РезультатыЗапроса.Количество() - 2].Выбрать();
	ПравилаУчета = РезультатыЗапроса[РезультатыЗапроса.Количество() - 1].Выгрузить();
	
	НаборЗаписей = РегистрыСведений.НастройкиОтправкиДокументовПоЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Пока ВыборкаСторонОбмена.Следующий() Цикл
		
		НастройкиПоУмолчанию = РегистрыСведений.НастройкиОтправкиДокументовПоЭДО.НастройкиОтправкиДокументовПоЭДО(
			ВыборкаСторонОбмена.Организация, ВыборкаСторонОбмена.Контрагент);
		
		Для Каждого Настройка Из НастройкиПоУмолчанию Цикл
			
			Запись = НаборЗаписей.Добавить();
			
			ЗаполнитьЗначенияСвойств(Запись, Настройка);
			Запись.Отправитель = ВыборкаСторонОбмена.Организация;
			Запись.Получатель = ВыборкаСторонОбмена.Контрагент;
			Запись.УдалитьВидЭД = Настройка.ВидЭД;
			Запись.УдалитьТипЭД = Настройка.ТипЭД;
			
			ОтборПравилУчета = Новый Структура;
			ОтборПравилУчета.Вставить("Организация", ВыборкаСторонОбмена.Организация);
			ОтборПравилУчета.Вставить("Контрагент", ВыборкаСторонОбмена.Контрагент);
			ОтборПравилУчета.Вставить("ВидДокумента", Настройка.ВидДокумента);
			
			СтрокиВПравилахУчета = ПравилаУчета.НайтиСтроки(ОтборПравилУчета);
			
			Если СтрокиВПравилахУчета.Количество() > 0 Тогда
				Запись.Отправлять = Истина;
			Иначе
				Запись.Отправлять = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиОтправкиДокументовПоЭДО");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстИсключения =
			НСтр("ru = 'При заполнении настроек отправки документов ПО ЭДО возникли ошибки по причине:'")
			+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.НастройкиОтправкиДокументовПоЭДО, ,
			ТекстИсключения);
		
		ВызватьИсключение ТекстИсключения;
		
	КонецПопытки;
	
КонецПроцедуры

// Заполняет очереди обработчиков обновления в ручном режиме в силу отличия версий БСП.
Процедура ОчередьОбновленияОбработчиковЭДО(ОбработчикИОчередь) Экспорт
	
	ОбработчикИОчередь.Вставить("Справочники.ТорговыеПредложения.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("Документы._ДемоОперация.ОбработатьДанныеДляПереходаНаНовуюВерсию", 2);
	ОбработчикИОчередь.Вставить("РегистрыСведений.ПодписываемыеВидыЭД.ОбработатьДанныеДляПереходаНаНовуюВерсию", 5);
	ОбработчикИОчередь.Вставить("Справочники.МаршрутыПодписания.ОбработатьДанныеДляПереходаНаНовуюВерсию", 3);
	ОбработчикИОчередь.Вставить("ОбменСБанками.ОбработатьРегистрПодписываемыеВидыЭД", 1);
	ОбработчикИОчередь.Вставить("ОбменСБанками.ПеренестиСтатусыЭлектронныхПодписей", 1);
	ОбработчикИОчередь.Вставить("Справочники.НастройкиОбменСБанками.ЗаполнитьВерсиюФормата", 1);
	ОбработчикИОчередь.Вставить("ОбменСБанками.ВключитьАвтоматическоеОбновлениеСпискаБанков", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.СостоянияОбменСБанками.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("ЭлектронноеВзаимодействиеОбработчикиОбновления.Справочники_НастройкиОбменСБанками_ОбработатьДанныеДляПереходаНаНовуюВерсию", 2);
	ОбработчикИОчередь.Вставить("ЭлектронноеВзаимодействиеОбработчикиОбновления.Документы_СообщениеОбменСБанками_ОбработатьДанныеДляПереходаНаНовуюВерсию", 5);
	ОбработчикИОчередь.Вставить("Справочники.СообщениеЭДОПрисоединенныеФайлы.ОбработатьДанныеДляПереходаНаНовуюВерсию", 2);
	ОбработчикИОчередь.Вставить("Справочники.ВидыДокументовЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("Документы.ЭлектронныйДокументВходящийЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию", 7);
	ОбработчикИОчередь.Вставить("Документы.ЭлектронныйДокументИсходящийЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию", 6);
	ОбработчикИОчередь.Вставить("РегистрыСведений.ФорматыЭлектронныхДокументов.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.ФорматыЭлектронныхДокументов.ОбработатьДанныеДляПереходаНаНовуюВерсиюНачальноеЗаполнение", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.СвязьВидовИФорматовДокументовЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию", 2);
	ОбработчикИОчередь.Вставить("РегистрыСведений.СвязьВидовИФорматовДокументовЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсиюНачальноеЗаполнение", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.СостояниеПодписанияЭД.ОбработатьДанныеДляПереходаНаНовуюВерсию", 3);
	ОбработчикИОчередь.Вставить("КонвертацияЭДО.ВыполнитьЗаполнениеПравилПреобразования", 1);
	ОбработчикИОчередь.Вставить("КонвертацияЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсиюНачальноеЗаполнение", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.КонтрольОтраженияВУчетеЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.СостоянияПоОбъектамУчетаЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию", 8);
	ОбработчикИОчередь.Вставить("НастройкиЭДОСлужебный.ВключитьИспользованиеОзнакомленийСЭД", 1);
	ОбработчикИОчередь.Вставить("НастройкиЭДОСлужебный.УстановкаЗначенияКонстантыСоздаватьКонтрагентовАвтоматическиБЭД", 1);
	ОбработчикИОчередь.Вставить("Справочники.УдалитьСоглашенияОбИспользованииЭД.ОбработатьДанныеДляПереходаНаНовуюВерсию", 2);
	ОбработчикИОчередь.Вставить("НастройкиЭДОСлужебный.ВключитьУтверждениеВходящихДокументов", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.НастройкиПолученияЭлектронныхДокументов.ОбработатьДанныеДляПереходаНаНовуюВерсию", 3);
	ОбработчикИОчередь.Вставить("РегистрыСведений.НастройкиЗаполненияДополнительныхПолей.ОбработатьДанныеДляПереходаНаНовуюВерсию", 3);
	ОбработчикИОчередь.Вставить("РегистрыСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.ОбработатьДанныеДляПереходаНаНовуюВерсию", 6);
	ОбработчикИОчередь.Вставить("Справочники.УдалитьПрофилиНастроекЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию", 2);
	ОбработчикИОчередь.Вставить("РегистрыСведений.СостоянияОбменовЭДЧерезОператоровЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("Документы.ТранспортныйКонтейнерЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию", 3);
	ОбработчикИОчередь.Вставить("РегистрыСведений.ПриглашенияКОбменуЭлектроннымиДокументами.ОбработатьДанныеДляПереходаНаНовуюВерсию", 6);
	ОбработчикИОчередь.Вставить("РегистрыСведений.ДанныеКонтрагентовСоздаваемыхБезусловно.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.ДанныеКонтрагентовСоздаваемыхБезусловно.ОбработатьДанныеДляПереходаНаНовуюВерсиюНачальноеЗаполнение", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.ОператорыЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.ОператорыЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсиюНачальноеЗаполнение", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.СовместимостьОператоровЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.СовместимостьОператоровЭДО.ОбработатьДанныеДляПереходаНаНовуюВерсиюНачальноеЗаполнение", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.НастройкиВнутреннегоЭДО.ВключитьИспользованиеВнутреннихДокументов", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.СоответствиеВидовНоменклатурыРаботаСНоменклатурой.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.СоответствиеНоменклатурыРаботаСНоменклатурой.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.УдалитьСоответствиеЗначенийРеквизитовБизнесСеть.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.УдалитьСоответствиеРеквизитовБизнесСеть.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.СловарьСопоставленияНоменклатурыБЭД.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.СтатистикаСловСловаряСопоставленияНоменклатурыБЭД.ОбработатьДанныеДляПереходаНаНовуюВерсию", 2);
	ОбработчикИОчередь.Вставить("РегистрыСведений.НоменклатураКонтрагентовБЭД.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	ОбработчикИОчередь.Вставить("РегистрыСведений.СостоянияСинхронизацииТорговыеПредложения.ОбработатьДанныеДляПереходаНаНовуюВерсию", 1);
	
КонецПроцедуры

#КонецОбласти

// См. ОбменСКонтрагентамиПереопределяемый.СпособыОтраженияВУчетеТипаЭлектронногоДокумента.
Процедура СпособыОтраженияВУчетеТипаЭлектронногоДокумента(ТипДокумента, СписокСпособовОбработки) Экспорт 
	
	СписокСпособовОбработки.Добавить("Автоматически_ДокументПредприятия", НСтр("ru = 'Документ'"), Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПолучениеДанныхИзДереваРазбора

Функция ДанныеДереваРазбораCML(ДеревоРазбора) Экспорт
	
	ДанныеДерева = Новый Структура;
	ДанныеДерева.Вставить("Документы", Неопределено);
	ДанныеДерева.Вставить("Валюты", Неопределено);
	ДанныеДерева.Вставить("Контрагенты", Неопределено);
	ДанныеДерева.Вставить("Организации", Неопределено);
	ДанныеДерева.Вставить("ЕдиницыИзмерения", Неопределено);
	ДанныеДерева.Вставить("Номенклатура", Неопределено);
	ДанныеДерева.Вставить("Банки", Неопределено);
	ДанныеДерева.Вставить("БанковскиеСчетаКонтрагентов", Неопределено);
	
	Для Каждого Строка Из ДеревоРазбора.Строки Цикл
		
		Если Строка.ТипОбъекта = "ОбменСКонтрагентами" Тогда
			
			СоответствиеДокументов = СоответствиеДокументовПоСтрокеДереваCML(Строка);
			ДанныеДерева.Документы = СоответствиеДокументов;
			
		ИначеЕсли Строка.ТипОбъекта = "Валюты" Тогда
			
			ТаблицаВалют = ТаблицаВалютПоСтрокеДереваCML(Строка);
			ДанныеДерева.Валюты = ТаблицаВалют;
			
		ИначеЕсли Строка.ТипОбъекта = "Контрагенты" Тогда
			
			ТаблицаКонтрагентов = ТаблицаКонтрагентовПоСтрокеДереваCML(Строка);
			ДанныеДерева.Контрагенты = ТаблицаКонтрагентов;
			
		ИначеЕсли Строка.ТипОбъекта = "Организации" Тогда
			
			ТаблицаОрганизаций = ТаблицаОрганизацийПоСтрокеДереваCML(Строка);
			ДанныеДерева.Организации = ТаблицаОрганизаций;
			
		ИначеЕсли Строка.ТипОбъекта = "ЕдиницыИзмерения" Тогда
			
			ТаблицаЕдиницИзмерения = ТаблицаЕдиницИзмеренияПоСтрокеДереваCML(Строка);
			ДанныеДерева.ЕдиницыИзмерения = ТаблицаЕдиницИзмерения;
			
		ИначеЕсли Строка.ТипОбъекта = "Номенклатура" Тогда
			
			ТаблицаНоменклатуры = ТаблицаНоменклатурыПоСтрокеДереваCML(Строка);
			ДанныеДерева.Номенклатура = ТаблицаНоменклатуры;
			
		ИначеЕсли Строка.ТипОбъекта = "Банки" Тогда
			
			ТаблицаБанков = ТаблицаБанковПоСтрокеДереваCML(Строка);
			ДанныеДерева.Банки = ТаблицаБанков;
			
		ИначеЕсли Строка.ТипОбъекта = "БанковскиеСчетаКонтрагентов" Тогда
			
			ТаблицаСчетов = ТаблицаБанковскихСчетовКонтрагентовПоСтрокеДереваCML(Строка);
			ДанныеДерева.БанковскиеСчетаКонтрагентов = ТаблицаСчетов;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеДерева;
	
КонецФункции

Функция СоответствиеДокументовПоСтрокеДереваCML(СтрокаОбменаСКонтрагентами)
	
	СоответствиеДокументов = Новый Соответствие;
	
	Для Каждого СтрокаДокумента Из СтрокаОбменаСКонтрагентами.Строки Цикл
		
		ДанныеДокумента = Новый Структура;
		
		ДанныеДокумента.Вставить("ВидЭД", СтрокаДокумента.ВидЭД);
		ДанныеДокумента.Вставить("Формат", СтрокаДокумента.ВерсияФормата);
		ДанныеДокумента.Вставить("ИД", СтрокаДокумента.ИД);
		ДанныеДокумента.Вставить("ТаблицаТоваров", НоваяТаблицаТоваровCML());
		
		Для Каждого СтрокаСвойств Из СтрокаДокумента.Строки Цикл
			
			Если СтрокаСвойств.Реквизит = "СтрокаТЧ" Тогда
				
				ДобавитьСтрокуТовараВТаблицуCML(ДанныеДокумента.ТаблицаТоваров, СтрокаСвойств);
				
			Иначе
				
				ДанныеДокумента.Вставить(СтрокаСвойств.Реквизит, СтрокаСвойств.ЗначениеРеквизита);
				
			КонецЕсли;
			
		КонецЦикла;
		
		СоответствиеДокументов.Вставить(ДанныеДокумента.ИД, ДанныеДокумента);
		
	КонецЦикла;
	
	Возврат СоответствиеДокументов;
	
КонецФункции

Функция НоваяТаблицаТоваровCML()
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
	ОписаниеТипаСтавкиНДС = Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС");
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	
	ТаблицаТоваров.Колонки.Добавить("Артикул", ОписаниеТипаСтрока);
	ТаблицаТоваров.Колонки.Добавить("Наименование", ОписаниеТипаСтрока);
	ТаблицаТоваров.Колонки.Добавить("СвойстваЕдиницы", ОписаниеТипаСтруктура);
	ТаблицаТоваров.Колонки.Добавить("Цена", ОписаниеТипаЧисло);
	ТаблицаТоваров.Колонки.Добавить("КоличествоУпаковок", ОписаниеТипаЧисло);
	ТаблицаТоваров.Колонки.Добавить("Коэффициент", ОписаниеТипаЧисло);
	ТаблицаТоваров.Колонки.Добавить("Количество", ОписаниеТипаЧисло);
	ТаблицаТоваров.Колонки.Добавить("Сумма", ОписаниеТипаЧисло);
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения", ОписаниеТипаСтрока);
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС", ОписаниеТипаСтавкиНДС);
	ТаблицаТоваров.Колонки.Добавить("СуммаНДС", ОписаниеТипаЧисло);
	ТаблицаТоваров.Колонки.Добавить("ЦенаВключаетНДС", ОписаниеТипаБулево);
	ТаблицаТоваров.Колонки.Добавить("СуммаСНДС", ОписаниеТипаЧисло);
	ТаблицаТоваров.Колонки.Добавить("НаименованиеСкидки", ОписаниеТипаСтрока);
	ТаблицаТоваров.Колонки.Добавить("СуммаСкидки", ОписаниеТипаЧисло);
	ТаблицаТоваров.Колонки.Добавить("ПроцентСкидки", ОписаниеТипаЧисло);
	ТаблицаТоваров.Колонки.Добавить("СкидкаУчтеноВСумме", ОписаниеТипаБулево);
	ТаблицаТоваров.Колонки.Добавить("КомментарийКСкидке", ОписаниеТипаСтрока);
	ТаблицаТоваров.Колонки.Добавить("ЦенаПродажи", ОписаниеТипаЧисло);
	ТаблицаТоваров.Колонки.Добавить("СуммаПродажи", ОписаниеТипаЧисло);
	ТаблицаТоваров.Колонки.Добавить("СуммаВознаграждения", ОписаниеТипаЧисло);
	ТаблицаТоваров.Колонки.Добавить("Упаковка", ОписаниеТипаСтрока);
	ТаблицаТоваров.Колонки.Добавить("Номенклатура", ОписаниеТипаСтрока);
	ТаблицаТоваров.Колонки.Добавить("Сопоставление", ОписаниеТипаСтруктура);
	ТаблицаТоваров.Колонки.Добавить("ДанныеДля1С", ОписаниеТипаСтруктура);
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Процедура ДобавитьСтрокуТовараВТаблицуCML(ТаблицаТоваров, СтрокаТовара)
	
	СвойстваСтрокиТовара = Новый Структура;
	СвойстваДля1С = Новый Структура;
	
	ЕстьСвойстваДля1С = Ложь;
	
	Для Каждого СтрокаСвойств Из СтрокаТовара.Строки Цикл
		
		Если СтрНачинаетсяС(СтрокаСвойств.Реквизит, "Для1С_") Тогда
			
			СвойстваДля1С.Вставить(СтрЗаменить(СтрокаСвойств.Реквизит, "Для1С_", ""),
				СтрокаСвойств.ЗначениеРеквизита);
			
			ЕстьСвойстваДля1С = Истина;
			Продолжить;
			
		КонецЕсли;
		
		СвойстваСтрокиТовара.Вставить(СтрокаСвойств.Реквизит, СтрокаСвойств.ЗначениеРеквизита);
		
	КонецЦикла;
	
	НоваяСтрокаТовара = ТаблицаТоваров.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрокаТовара, СвойстваСтрокиТовара);
	
	Если ЕстьСвойстваДля1С Тогда
		НоваяСтрокаТовара.ДанныеДля1С = СвойстваДля1С;
	КонецЕсли;
	
КонецПроцедуры

Функция ТаблицаВалютПоСтрокеДереваCML(СтрокаВалют)
	
	ТаблицаВалют = Новый ТаблицаЗначений;
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТиповВалюты = Новый ОписаниеТипов("СправочникСсылка.Валюты");
	
	ТаблицаВалют.Колонки.Добавить("ИД", ОписаниеТиповСтрока);
	ТаблицаВалют.Колонки.Добавить("ИндексСтроки", ОписаниеТиповСтрока);
	ТаблицаВалют.Колонки.Добавить("СсылкаНаОбъект", ОписаниеТиповВалюты);
	
	ТаблицаВалют.Колонки.Добавить("Код", ОписаниеТиповСтрока);
	ТаблицаВалют.Колонки.Добавить("КодМКВ", ОписаниеТиповСтрока);
	ТаблицаВалют.Колонки.Добавить("Наименование", ОписаниеТиповСтрока);
	ТаблицаВалют.Колонки.Добавить("НаименованиеПолное", ОписаниеТиповСтрока);
	
	Для Каждого Строка Из СтрокаВалют.Строки Цикл
		
		НоваяВалюта = ТаблицаВалют.Добавить();
		
		НоваяВалюта.ИД = Строка.ИД;
		НоваяВалюта.ИндексСтроки = Строка.ИндексСтроки;
		НоваяВалюта.СсылкаНаОбъект = Строка.СсылкаНаОбъект;
		
		Для Каждого СтрокаСвойств Из Строка.Строки Цикл
			
			Если СтрокаСвойств.Реквизит = "Код" Тогда
				НоваяВалюта.Код = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "КодМКВ" Тогда
				НоваяВалюта.КодМКВ = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "Наименование" Тогда
				НоваяВалюта.Наименование = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "НаименованиеПолное" Тогда
				НоваяВалюта.НаименованиеПолное = СтрокаСвойств.ЗначениеРеквизита;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаВалют;
	
КонецФункции

Функция ТаблицаКонтрагентовПоСтрокеДереваCML(СтрокаКонтрагентов)
	
	ТаблицаКонтрагентов = Новый ТаблицаЗначений;
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТиповСтруктура = Новый ОписаниеТипов("Структура");
	
	ТаблицаКонтрагентов.Колонки.Добавить("ИД", ОписаниеТиповСтрока);
	ТаблицаКонтрагентов.Колонки.Добавить("ИндексСтроки", ОписаниеТиповСтрока);
	
	ТаблицаКонтрагентов.Колонки.Добавить("ПолноеНаименование", ОписаниеТиповСтрока);
	ТаблицаКонтрагентов.Колонки.Добавить("ОфициальноеНаименование", ОписаниеТиповСтрока); 
	ТаблицаКонтрагентов.Колонки.Добавить("ИНН", ОписаниеТиповСтрока);
	ТаблицаКонтрагентов.Колонки.Добавить("КПП", ОписаниеТиповСтрока);
	ТаблицаКонтрагентов.Колонки.Добавить("ФактическийАдрес_Представление", ОписаниеТиповСтрока);
	ТаблицаКонтрагентов.Колонки.Добавить("АдресСтруктурой", ОписаниеТиповСтруктура);
	ТаблицаКонтрагентов.Колонки.Добавить("Роль", ОписаниеТиповСтрока);
	ТаблицаКонтрагентов.Колонки.Добавить("БанковскийСчетКонтрагента", ОписаниеТиповСтрока);
	
	Для Каждого Строка Из СтрокаКонтрагентов.Строки Цикл
		
		НовыйКонтрагент = ТаблицаКонтрагентов.Добавить();
		
		НовыйКонтрагент.ИД = Строка.ИД;
		НовыйКонтрагент.ИндексСтроки = Строка.ИндексСтроки;
		
		Для Каждого СтрокаСвойств Из Строка.Строки Цикл
			
			Если СтрокаСвойств.Реквизит = "ПолноеНаименование" Тогда
				НовыйКонтрагент.ПолноеНаименование = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "ОфициальноеНаименование" Тогда
				НовыйКонтрагент.ОфициальноеНаименование = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "ИНН" Тогда
				НовыйКонтрагент.ИНН = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "КПП" Тогда
				НовыйКонтрагент.КПП = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "ФактическийАдрес_Представление" Тогда
				НовыйКонтрагент.ФактическийАдрес_Представление = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "АдресСтруктурой" Тогда
				НовыйКонтрагент.АдресСтруктурой = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "Роль" Тогда
				НовыйКонтрагент.Роль = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "БанковскийСчетКонтрагента" Тогда
				НовыйКонтрагент.БанковскийСчетКонтрагента = СтрокаСвойств.ЗначениеРеквизита;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаКонтрагентов;
	
КонецФункции

Функция ТаблицаОрганизацийПоСтрокеДереваCML(СтрокаОрганизаций)
	
	ТаблицаОрганизаций = Новый ТаблицаЗначений;
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТиповСтруктура = Новый ОписаниеТипов("Структура");
	
	ТаблицаОрганизаций.Колонки.Добавить("ИД", ОписаниеТиповСтрока);
	ТаблицаОрганизаций.Колонки.Добавить("ИндексСтроки", ОписаниеТиповСтрока);
	
	ТаблицаОрганизаций.Колонки.Добавить("ПолноеНаименование", ОписаниеТиповСтрока);
	ТаблицаОрганизаций.Колонки.Добавить("ИНН", ОписаниеТиповСтрока);
	ТаблицаОрганизаций.Колонки.Добавить("КПП", ОписаниеТиповСтрока);
	ТаблицаОрганизаций.Колонки.Добавить("ФактическийАдрес_Представление", ОписаниеТиповСтрока);
	ТаблицаОрганизаций.Колонки.Добавить("АдресСтруктурой", ОписаниеТиповСтруктура);
	ТаблицаОрганизаций.Колонки.Добавить("Роль", ОписаниеТиповСтрока);
	
	Для Каждого Строка Из СтрокаОрганизаций.Строки Цикл
		
		НоваяОрганизация = ТаблицаОрганизаций.Добавить();
		
		НоваяОрганизация.ИД = Строка.ИД;
		НоваяОрганизация.ИндексСтроки = Строка.ИндексСтроки;
		
		Для Каждого СтрокаСвойств Из Строка.Строки Цикл
			
			Если СтрокаСвойств.Реквизит = "ПолноеНаименование" Тогда
				НоваяОрганизация.ПолноеНаименование = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "ИНН" Тогда
				НоваяОрганизация.ИНН = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "КПП" Тогда
				НоваяОрганизация.КПП = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "ФактическийАдрес_Представление" Тогда
				НоваяОрганизация.ФактическийАдрес_Представление = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "АдресСтруктурой" Тогда
				НоваяОрганизация.АдресСтруктурой = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "Роль" Тогда
				НоваяОрганизация.Роль = СтрокаСвойств.ЗначениеРеквизита;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаОрганизаций;
	
КонецФункции

Функция ТаблицаЕдиницИзмеренияПоСтрокеДереваCML(СтрокаЕдиницИзмерения)
	
	ТаблицаЕдиницИзмерения = Новый ТаблицаЗначений;
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТиповЕдиницыИзмерения = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения");
	
	ТаблицаЕдиницИзмерения.Колонки.Добавить("ИД", ОписаниеТиповСтрока);
	ТаблицаЕдиницИзмерения.Колонки.Добавить("ИндексСтроки", ОписаниеТиповСтрока);
	ТаблицаЕдиницИзмерения.Колонки.Добавить("СсылкаНаОбъект", ОписаниеТиповЕдиницыИзмерения);
	
	ТаблицаЕдиницИзмерения.Колонки.Добавить("Код", ОписаниеТиповСтрока);
	ТаблицаЕдиницИзмерения.Колонки.Добавить("Наименование", ОписаниеТиповСтрока);
	ТаблицаЕдиницИзмерения.Колонки.Добавить("НаименованиеПолное", ОписаниеТиповСтрока);
	ТаблицаЕдиницИзмерения.Колонки.Добавить("МеждународноеСокращение", ОписаниеТиповСтрока);
	
	Для Каждого Строка Из СтрокаЕдиницИзмерения.Строки Цикл
		
		НоваяЕдиницаИзмерения = ТаблицаЕдиницИзмерения.Добавить();
		
		НоваяЕдиницаИзмерения.ИД = Строка.ИД;
		НоваяЕдиницаИзмерения.ИндексСтроки = Строка.ИндексСтроки;
		НоваяЕдиницаИзмерения.СсылкаНаОбъект = Строка.СсылкаНаОбъект;
		
		Для Каждого СтрокаСвойств Из Строка.Строки Цикл
			
			Если СтрокаСвойств.Реквизит = "Код" Тогда
				НоваяЕдиницаИзмерения.Код = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "Наименование" Тогда
				НоваяЕдиницаИзмерения.Наименование = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "НаименованиеПолное" Тогда
				НоваяЕдиницаИзмерения.НаименованиеПолное = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "МеждународноеСокращение" Тогда
				НоваяЕдиницаИзмерения.МеждународноеСокращение = СтрокаСвойств.ЗначениеРеквизита;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаЕдиницИзмерения;
	
КонецФункции

Функция ТаблицаНоменклатурыПоСтрокеДереваCML(СтрокаНоменклатуры)
	
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	
	ТаблицаНоменклатуры.Колонки.Добавить("ИД", ОписаниеТиповСтрока);
	ТаблицаНоменклатуры.Колонки.Добавить("ИндексСтроки", ОписаниеТиповСтрока);
	
	ТаблицаНоменклатуры.Колонки.Добавить("ИдентификаторНоменклатуры", ОписаниеТиповСтрока);
	ТаблицаНоменклатуры.Колонки.Добавить("Наименование", ОписаниеТиповСтрока);
	ТаблицаНоменклатуры.Колонки.Добавить("Артикул", ОписаниеТиповСтрока);
	ТаблицаНоменклатуры.Колонки.Добавить("ЕдиницаИзмерения", ОписаниеТиповСтрока);
	ТаблицаНоменклатуры.Колонки.Добавить("НомерСтроки", ОписаниеТиповСтрока);
	
	Для Каждого Строка Из СтрокаНоменклатуры.Строки Цикл
		
		НоваяНоменклатура = ТаблицаНоменклатуры.Добавить();
		
		НоваяНоменклатура.ИД = Строка.ИД;
		НоваяНоменклатура.ИндексСтроки = Строка.ИндексСтроки;
		
		Для Каждого СтрокаСвойств Из Строка.Строки Цикл
			
			Если СтрокаСвойств.Реквизит = "Ид" Тогда
				НоваяНоменклатура.ИдентификаторНоменклатуры = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "Наименование" Тогда
				НоваяНоменклатура.Наименование = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "Артикул" Тогда
				НоваяНоменклатура.Артикул = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "ЕдиницаИзмерения" Тогда
				НоваяНоменклатура.ЕдиницаИзмерения = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "НомерСтроки" Тогда
				НоваяНоменклатура.НомерСтроки = СтрокаСвойств.ЗначениеРеквизита;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаНоменклатуры;
	
КонецФункции

Функция ТаблицаБанковПоСтрокеДереваCML(СтрокаБанков)
	
	ТаблицаБанков = Новый ТаблицаЗначений;
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	
	ТаблицаБанков.Колонки.Добавить("ИД", ОписаниеТиповСтрока);
	ТаблицаБанков.Колонки.Добавить("ИндексСтроки", ОписаниеТиповСтрока);
	
	ТаблицаБанков.Колонки.Добавить("Код", ОписаниеТиповСтрока);
	ТаблицаБанков.Колонки.Добавить("Наименование", ОписаниеТиповСтрока);
	ТаблицаБанков.Колонки.Добавить("КоррСчет", ОписаниеТиповСтрока);
	
	Для Каждого Строка Из СтрокаБанков.Строки Цикл
		
		НовыйБанк = ТаблицаБанков.Добавить();
		
		НовыйБанк.ИД = Строка.ИД;
		НовыйБанк.ИндексСтроки = Строка.ИндексСтроки;
		
		Для Каждого СтрокаСвойств Из Строка.Строки Цикл
			
			Если СтрокаСвойств.Реквизит = "Код" Тогда
				НовыйБанк.Код = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "Наименование" Тогда
				НовыйБанк.Наименование = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "КоррСчет" Тогда
				НовыйБанк.КоррСчет = СтрокаСвойств.ЗначениеРеквизита;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаБанков;
	
КонецФункции

Функция ТаблицаБанковскихСчетовКонтрагентовПоСтрокеДереваCML(СтрокаСчетовКонтрагентов)
	
	ТаблицаБанковскихСчетовКонтрагентов = Новый ТаблицаЗначений;
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	
	ТаблицаБанковскихСчетовКонтрагентов.Колонки.Добавить("ИД", ОписаниеТиповСтрока);
	ТаблицаБанковскихСчетовКонтрагентов.Колонки.Добавить("ИндексСтроки", ОписаниеТиповСтрока);
	
	ТаблицаБанковскихСчетовКонтрагентов.Колонки.Добавить("НомерСчета", ОписаниеТиповСтрока);
	ТаблицаБанковскихСчетовКонтрагентов.Колонки.Добавить("Комментарий", ОписаниеТиповСтрока);
	ТаблицаБанковскихСчетовКонтрагентов.Колонки.Добавить("Банк", ОписаниеТиповСтрока);
	ТаблицаБанковскихСчетовКонтрагентов.Колонки.Добавить("БанкКорреспондент", ОписаниеТиповСтрока);
	
	Для Каждого Строка Из СтрокаСчетовКонтрагентов.Строки Цикл
		
		НовыйСчет = ТаблицаБанковскихСчетовКонтрагентов.Добавить();
		
		НовыйСчет.ИД = Строка.ИД;
		НовыйСчет.ИндексСтроки = Строка.ИндексСтроки;
		
		Для Каждого СтрокаСвойств Из Строка.Строки Цикл
			
			Если СтрокаСвойств.Реквизит = "НомерСчета" Тогда
				НовыйСчет.НомерСчета = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "Комментарий" Тогда
				НовыйСчет.Комментарий = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "Банк" Тогда
				НовыйСчет.Банк = СтрокаСвойств.ЗначениеРеквизита;
			ИначеЕсли СтрокаСвойств.Реквизит = "БанкКорреспондент" Тогда
				НовыйСчет.БанкКорреспондент = СтрокаСвойств.ЗначениеРеквизита;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаБанковскихСчетовКонтрагентов;
	
КонецФункции

#КонецОбласти

#Область РаботаСДаннымиДереваРазбора

Функция ДанныеВалютыПоДаннымCML(ДанныеДереваРазбора, ИндексСтрокиВалюты, Ошибки = Неопределено) Экспорт
	
	ДанныеВалюты = Новый Структура;
	ДанныеВалюты.Вставить("Ссылка", Справочники.Валюты.ПустаяСсылка());
	ДанныеВалюты.Вставить("Код", "");
	ДанныеВалюты.Вставить("КодМКВ", "");
	ДанныеВалюты.Вставить("Наименование", "");
	ДанныеВалюты.Вставить("НаименованиеПолное", "");
	
	ТаблицаВалют = ДанныеДереваРазбора.Валюты;
	
	Если ТаблицаВалют = Неопределено Тогда
		ОписаниеПроблемы = НСтр("ru = 'Не удалось получить данные о валютах из дерева разбора CML.'");
		ДобавитьОшибкуРазбораCML(ОписаниеПроблемы, Ошибки);
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокиВалюты = ТаблицаВалют.НайтиСтроки(
		Новый Структура("ИндексСтроки", ИндексСтрокиВалюты));
	
	Если СтрокиВалюты.Количество() = 0 Тогда
		ОписаниеПроблемы = НСтр("ru = 'Не удалось получить данные о валюте документа из дерева разбора CML.'");
		ДобавитьОшибкуРазбораCML(ОписаниеПроблемы, Ошибки);
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДанныеВалюты, СтрокиВалюты[0]);
	
	Возврат ДанныеВалюты;
	
КонецФункции

#КонецОбласти

Процедура ДобавитьОшибкуРазбораCML(ТекстОшибки, МассивОшибок)
	
	Если МассивОшибок = Неопределено Тогда
		МассивОшибок = Новый Массив;
	КонецЕсли;
	
	МассивОшибок.Добавить(ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
